<?php
// +----------------------------------------------------------------------
// | Captcha配置文件
// +----------------------------------------------------------------------

return [
    'login' => [
        'length'    => 6,
        'imageW'    => 180,
        'bg'        => [255,255,255]
    ],
    //验证码位数
    'length'        => 5,
    // 验证码字符集合
    'codeSet'       => '23456789abcdefghjkmnpqrstuvwxyz',
    // 验证码过期时间
    'expire'        => 1800,
    // 是否使用中文验证码
    'useZh'         => false,
    // 是否使用算术验证码
    'math'          => false,
    // 是否使用背景图
    'useImgBg'      => false,
    //验证码字符大小
    'fontSize'      => 800,
    // 是否使用混淆曲线
    'useCurve'      => true,
    //是否添加杂点
    'bg'            => [243, 251, 254],
    // 验证码字体 不设置则随机
    'fontttf'       => '',
    //背景颜色
    'bg'            => [243, 251, 254],
    // 验证码字体 不设置则随机
    'fontttf'       => '',
    //背景颜色
    'bg'            => [243, 251, 254],
    // 验证码字体 不设置则随机
    'fontttf'       => '',
    //背景颜色
    // 是否采用API模式生成
    'api'           => false,
];
