<?php

//+----------------------------------------------------------------------
//| MySQL数据库配置
//+----------------------------------------------------------------------
return [
    'default'               =>    'mysql',
    'connections'           =>    [
        'mysql'             =>    [
            // 数据库类型
            'type'          => 'mysql',
            // 服务器地址
            'hostname'      => '192.168.222.146',
            // 数据库名
            'database'      => 'web',
            // 数据库用户名
            'username'      => 'root',
            // 数据库密码
            'password'      => '202019',
            // 数据库连接端口
            'hostport'      => '3306',
            // 数据库连接参数
            'params'        => [],
            // 数据库编码默认采用utf8
            'charset'        => 'utf8',
            // 数据库表前缀
            'prefix'        => 'tp_',
        ],
    ],
];